# Problem Statement

An automobile parts manufacturing company has collected data on transactions for 3 years. They do not have any in-house data science team, thus they have hired you as their consultant. Your job is to use your data science skills to find the underlying buying patterns of the customers, provide the company with suitable insights about their customers, and recommend customized marketing strategies for different segments of customers.

## Importing Libraries

In [1]:
import warnings
warnings.filterwarnings("ignore")

#For Data Wrangling/Data Processing
import numpy as np   
import pandas as pd    

#For Data Visualization
import seaborn as sns
import matplotlib.pyplot as plt 
%matplotlib inline 
import matplotlib.style

## Reading and Loading the Excel file

In [3]:
df1 = pd.read_csv('C:\\Users\\ramas\\Great Learning\\MONTH 10 - MRA\\dataset_group.csv')

In [4]:
df1.head()

         Date  Order_id        Product
0  01-01-2018         1         yogurt
1  01-01-2018         1           pork
2  01-01-2018         1  sandwich bags
3  01-01-2018         1     lunch meat
4  01-01-2018         1   all- purpose

## Shape of the data

In [5]:
df1.shape

(20641, 3)

## Info of the data

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20641 entries, 0 to 20640
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20641 non-null  object
 1   Order_id  20641 non-null  int64
 2   Product   20641 non-null  object
dtypes: int64(1), object(2)
memory usage: 483.9+ KB

In [7]:
df1.describe().T

            count        mean         std  min    25%    50%    75%     max
Order_id  20641.0  575.986289  328.557078  1.0  292.0  581.0  862.0  1139.0

In [8]:
df1.describe(include = 'object').T

         count unique         top freq
Date     20641    603  08-02-2019  183
Product  20641     37     poultry  640

In [9]:
df1.isnull().sum()

Date        0
Order_id    0
Product     0
dtype: int64